GopalSaraf/Practicals/PSDL/include/proc/pic16lf1718.inc
// Register: CKPPS
#define CKPPS CKPPS
CKPPS                                    equ 0E25h
// bitfield definitions
CKPPS_CKPPS_POSN                         equ 0000h
CKPPS_CKPPS_POSITION                     equ 0000h
CKPPS_CKPPS_SIZE                         equ 0005h
CKPPS_CKPPS_LENGTH                       equ 0005h
CKPPS_CKPPS_MASK                         equ 001Fh

// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
CLCIN0PPS                                equ 0E28h
// bitfield definitions
CLCIN0PPS_CLCIN0PPS_POSN                 equ 0000h
CLCIN0PPS_CLCIN0PPS_POSITION             equ 0000h
CLCIN0PPS_CLCIN0PPS_SIZE                 equ 0005h
CLCIN0PPS_CLCIN0PPS_LENGTH               equ 0005h
CLCIN0PPS_CLCIN0PPS_MASK                 equ 001Fh

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
CLCIN1PPS                                equ 0E29h
// bitfield definitions
CLCIN1PPS_CLCIN1PPS_POSN                 equ 0000h
CLCIN1PPS_CLCIN1PPS_POSITION             equ 0000h
CLCIN1PPS_CLCIN1PPS_SIZE                 equ 0005h
CLCIN1PPS_CLCIN1PPS_LENGTH               equ 0005h
CLCIN1PPS_CLCIN1PPS_MASK                 equ 001Fh

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
CLCIN2PPS                                equ 0E2Ah
// bitfield definitions
CLCIN2PPS_CLCIN2PPS_POSN                 equ 0000h
CLCIN2PPS_CLCIN2PPS_POSITION             equ 0000h
CLCIN2PPS_CLCIN2PPS_SIZE                 equ 0005h
CLCIN2PPS_CLCIN2PPS_LENGTH               equ 0005h
CLCIN2PPS_CLCIN2PPS_MASK                 equ 001Fh

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
CLCIN3PPS                                equ 0E2Bh
// bitfield definitions
CLCIN3PPS_CLCIN3PPS_POSN                 equ 0000h
CLCIN3PPS_CLCIN3PPS_POSITION             equ 0000h
CLCIN3PPS_CLCIN3PPS_SIZE                 equ 0005h
CLCIN3PPS_CLCIN3PPS_LENGTH               equ 0005h
CLCIN3PPS_CLCIN3PPS_MASK                 equ 001Fh

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 0E90h
// bitfield definitions
RA0PPS_RA0PPS_POSN                       equ 0000h
RA0PPS_RA0PPS_POSITION                   equ 0000h
RA0PPS_RA0PPS_SIZE                       equ 0005h
RA0PPS_RA0PPS_LENGTH                     equ 0005h
RA0PPS_RA0PPS_MASK                       equ 001Fh

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 0E91h
// bitfield definitions
RA1PPS_RA1PPS_POSN                       equ 0000h
RA1PPS_RA1PPS_POSITION                   equ 0000h
RA1PPS_RA1PPS_SIZE                       equ 0005h
RA1PPS_RA1PPS_LENGTH                     equ 0005h
RA1PPS_RA1PPS_MASK                       equ 001Fh

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 0E92h
// bitfield definitions
RA2PPS_RA2PPS_POSN                       equ 0000h
RA2PPS_RA2PPS_POSITION                   equ 0000h
RA2PPS_RA2PPS_SIZE                       equ 0005h
RA2PPS_RA2PPS_LENGTH                     equ 0005h
RA2PPS_RA2PPS_MASK                       equ 001Fh

// Register: RA3PPS
#define RA3PPS RA3PPS
RA3PPS                                   equ 0E93h
// bitfield definitions
RA3PPS_RA3PPS_POSN                       equ 0000h
RA3PPS_RA3PPS_POSITION                   equ 0000h
RA3PPS_RA3PPS_SIZE                       equ 0005h
RA3PPS_RA3PPS_LENGTH                     equ 0005h
RA3PPS_RA3PPS_MASK                       equ 001Fh

// Register: RA4PPS
#define RA4PPS RA4PPS
RA4PPS                                   equ 0E94h
// bitfield definitions
RA4PPS_RA4PPS_POSN                       equ 0000h
RA4PPS_RA4PPS_POSITION                   equ 0000h
RA4PPS_RA4PPS_SIZE                       equ 0005h
RA4PPS_RA4PPS_LENGTH                     equ 0005h
RA4PPS_RA4PPS_MASK                       equ 001Fh

// Register: RA5PPS
#define RA5PPS RA5PPS
RA5PPS                                   equ 0E95h
// bitfield definitions
RA5PPS_RA5PPS_POSN                       equ 0000h
RA5PPS_RA5PPS_POSITION                   equ 0000h
RA5PPS_RA5PPS_SIZE                       equ 0005h
RA5PPS_RA5PPS_LENGTH                     equ 0005h
RA5PPS_RA5PPS_MASK                       equ 001Fh

// Register: RA6PPS
#define RA6PPS RA6PPS
RA6PPS                                   equ 0E96h
// bitfield definitions
RA6PPS_RA6PPS_POSN                       equ 0000h
RA6PPS_RA6PPS_POSITION                   equ 0000h
RA6PPS_RA6PPS_SIZE                       equ 0005h
RA6PPS_RA6PPS_LENGTH                     equ 0005h
RA6PPS_RA6PPS_MASK                       equ 001Fh

// Register: RA7PPS
#define RA7PPS RA7PPS
RA7PPS                                   equ 0E97h
// bitfield definitions
RA7PPS_RA7PPS_POSN                       equ 0000h
RA7PPS_RA7PPS_POSITION                   equ 0000h
RA7PPS_RA7PPS_SIZE                       equ 0005h
RA7PPS_RA7PPS_LENGTH                     equ 0005h
RA7PPS_RA7PPS_MASK                       equ 001Fh

// Register: RB0PPS
#define RB0PPS RB0PPS
RB0PPS                                   equ 0E98h
// bitfield definitions
RB0PPS_RB0PPS_POSN                       equ 0000h
RB0PPS_RB0PPS_POSITION                   equ 0000h
RB0PPS_RB0PPS_SIZE                       equ 0005h
RB0PPS_RB0PPS_LENGTH                     equ 0005h
RB0PPS_RB0PPS_MASK                       equ 001Fh

// Register: RB1PPS
#define RB1PPS RB1PPS
RB1PPS                                   equ 0E99h
// bitfield definitions
RB1PPS_RB1PPS_POSN                       equ 0000h
RB1PPS_RB1PPS_POSITION                   equ 0000h
RB1PPS_RB1PPS_SIZE                       equ 0005h
RB1PPS_RB1PPS_LENGTH                     equ 0005h
RB1PPS_RB1PPS_MASK                       equ 001Fh

// Register: RB2PPS
#define RB2PPS RB2PPS
RB2PPS                                   equ 0E9Ah
// bitfield definitions
RB2PPS_RB2PPS_POSN                       equ 0000h
RB2PPS_RB2PPS_POSITION                   equ 0000h
RB2PPS_RB2PPS_SIZE                       equ 0005h
RB2PPS_RB2PPS_LENGTH                     equ 0005h
RB2PPS_RB2PPS_MASK                       equ 001Fh

